Data Cleaning and Processing

In this stage, the following will be performed:
- Data importation and preparation;
- Exploratory analysis;
- Data processing.

Objective:
The provided data is from a financial institution and aims to create a churn analysis model. The goal is to predict which customers will leave the company, allowing for the implementation of measures to prevent their departure. The file name of the analysis suggests a classic case of this problem.

In [1]:
import pandas as pd
import seaborn as srn
import statistics as sts

In [2]:
#Importando os dados de um arquivo CSV.
dados = pd.read_csv("Churn.csv", sep=';')

#Visualizando os dados de forma tabular;
dados.head() #retorna os 05 primeiros dados do dataframe

   X0   X1  X2        X3  X4  X4.1        X6  X7  X8  X9         X10  X11
0   1  619  RS  Feminino  42     2         0   1   1   1  10134888.0    1
1   2  608  SC  Feminino  41     1   8380786   1   0   1  11254258.0    0
2   3  502  RS  Feminino  42     8   1596608   3   1   0  11393157.0    1
3   4  699  RS  Feminino  39     1         0   2   0   0   9382663.0    0
4   5  850  SC  Feminino  43     2  12551082   1   1   1    790841.0    0

In [3]:
#Entitulando colunas:
dados.columns = ['ID','Score','State','Gender','Age','Wealth','Balance','Products','CreditCard','Active',
                 'Salary','Exited']

dados.head()

,ID,Score,State,Gender,Age,Wealth,Balance,Products,CreditCard,Active,Salary,Exited
0,1,619,RS,Feminino,42,2,0,1,1,1,10134888.0,1
1,2,608,SC,Feminino,41,1,8380786,1,0,1,11254258.0,0
2,3,502,RS,Feminino,42,8,1596608,3,1,0,11393157.0,1
3,4,699,RS,Feminino,39,1,0,2,0,0,9382663.0,0
4,5,850,SC,Feminino,43,2,12551082,1,1,1,790841.0,0

Explotory Analysis
- Exploring and familiarizing ourselves with our data, we aim to identify the presence of outliers, blank values, incorrect information, and other irregularities.

In [4]:
gstate = dados.groupby(['State']).size() #Grouped data;
gstate
# gstate.plot.bar(color = 'black') - Graphical analysis;

State
PR    257
RP      1
RS    478
SC    258
SP      4
TD      1
dtype: int64

In [5]:
ggender = dados.groupby(['Gender']).size() #Grouped data;

ggender
# ggender.plot.bar(color = 'black') - Graphical analysis;

Gender
F              2
Fem            1
Feminino     461
M              6
Masculino    521
dtype: int64

In [6]:
dados['Score'].describe() #Grouped data;

#srn.boxplot(dados['Score']).set_title('Score') - Graphical analysis;
#srn.distplot(dados['Score']).set_title('Score') - Graphical analysis;

count    999.000000
mean     648.621622
std       98.264219
min      376.000000
25%      580.000000
50%      653.000000
75%      721.000000
max      850.000000
Name: Score, dtype: float64

In [7]:
dados['Age'].describe() #Grouped data;

#srn.boxplot(dados['Age']).set_title('Score') - Graphical analysis;
#srn.distplot(dados['Age']).set_title('Score') - Graphical analysis;

count    999.000000
mean      38.902903
std       11.401912
min      -20.000000
25%       32.000000
50%       37.000000
75%       44.000000
max      140.000000
Name: Age, dtype: float64

In [8]:
dados['Balance'].describe() #Grouped data;

#srn.boxplot(dados['Balance']).set_title('Score') - Graphical analysis;
#srn.distplot(dados['Balance']).set_title('Score') - Graphical analysis;

count    9.990000e+02
mean     7.164928e+06
std      6.311840e+06
min      0.000000e+00
25%      0.000000e+00
50%      8.958835e+06
75%      1.258684e+07
max      2.117743e+07
Name: Balance, dtype: float64

In [9]:
dados['Salary'].describe() #Grouped data;

#srn.boxplot(dados['Salary']).set_title('Score') - Graphical analysis;
#srn.distplot(dados['Salary']).set_title('Score') - Graphical analysis;

count    9.920000e+02
mean     3.528762e+07
std      5.305800e+08
min      9.677000e+03
25%      3.029011e+06
50%      8.703250e+06
75%      1.405213e+07
max      1.193469e+10
Name: Salary, dtype: float64

In [10]:
#Checking for blank information.
dados.isnull().sum()

ID            0
Score         0
State         0
Gender        8
Age           0
Wealth        0
Balance       0
Products      0
CreditCard    0
Active        0
Salary        7
Exited        0
dtype: int64

In [11]:
#Checking for the existence of duplicate data.
dados[dados.duplicated(['ID'],keep=False)]

,ID,Score,State,Gender,Age,Wealth,Balance,Products,CreditCard,Active,Salary,Exited
80,81,665,RS,Feminino,34,1,9664554,2,0,0,17141366.0,0
81,81,665,RS,Feminino,34,1,9664554,2,0,0,17141366.0,0

Data processing
- During the exploratory analysis of the process, we identified and handled incorrect data;

In [12]:
#Filling in blank values in the "Salary" column with the median.
median_salary = sts.median(dados['Salary'])
dados['Salary'].fillna(median_salary, inplace=True) #(inplace=True) makes the changes directly in the dataset itself.

dados['Salary'].isnull().sum()

0

In [13]:
#Filling in blank values in the "Gender" column with the mode (Male).

dados['Gender'].fillna('Masculino',inplace=True) #(inplace=True) makes the changes directly in the dataset itself.
dados['Gender'].isnull().sum()

0

In [14]:
#Standardizing the data in the "Gender" column to only include 'Male' or 'Female'.

dados.loc[dados['Gender'] == 'M','Gender'] = 'Masculino'
dados.loc[dados['Gender'].isin(['Fem','F']), 'Gender'] = 'Feminino' #isin(['Fem','F']) checks for data containing both specified clauses.

ggender = dados.groupby(['Gender']).size()
ggender

Gender
Feminino     464
Masculino    535
dtype: int64

In [15]:
#Handling the "Age" column.
median_age = sts.median(dados['Age'])

#Defining age parameters for the dataset (minimum age 0, maximum age 120).
dados.loc[(dados['Age'] < 0) | (dados['Age'] > 120)] # Locating data outside our parameter.

,ID,Score,State,Gender,Age,Wealth,Balance,Products,CreditCard,Active,Salary,Exited
867,869,636,RS,Feminino,-10,1,17083346,1,1,0,11051028.0,1
984,986,773,RS,Masculino,-20,1,12453278,2,0,1,1172357.0,0
990,992,655,RS,Masculino,140,5,93147,2,1,0,6621413.0,0

In [16]:
#Filling in the data in the "Age" column that are outside our parameter with the median.
dados.loc[(dados['Age'] < 0) | (dados['Age'] > 120)] = median_age

dados.loc[(dados['Age'] < 0) | (dados['Age'] > 120)] #Locating if have data outside our parameter.

Empty DataFrame
Columns: [ID, Score, State, Gender, Age, Wealth, Balance, Products, CreditCard, Active, Salary, Exited]
Index: []

In [17]:
#Removing duplicate data.
dados.drop_duplicates(subset='ID',keep='first',inplace=True)

dados[dados.duplicated(['ID'],keep=False)] #Locating if have duplicated data

Empty DataFrame
Columns: [ID, Score, State, Gender, Age, Wealth, Balance, Products, CreditCard, Active, Salary, Exited]
Index: []

In [18]:
#Handling the "State" column, we will replace incorrect or out-of-parameter data with the mode (the most frequently occurring state in the dataframe).
gstate = dados.groupby(['State']).size()
gstate

State
PR    257
RP      1
RS    474
SC    258
SP      4
TD      1
dtype: int64

In [19]:
dados.loc[dados['State'].isin(['RP','SP','TD']),'State'] = 'RS'
gstate = dados.groupby(['State']).size()
gstate

State
PR    257
RS    480
SC    258
dtype: int64

In [20]:
#Treating outliers in the salary column.
#Our business rule will be, if a salary is greater than 2 times the stdev_salary, it will be considered an outlier and replaced by the median_salary.
stdev_salary = sts.stdev(dados['Salary'])
dados.loc[dados['Salary'] >= 2 * stdev_salary]

,ID,Score,State,Gender,Age,Wealth,Balance,Products,CreditCard,Active,Salary,Exited
7,8,376,PR,Feminino,29,4,11504674,4,1,0,1.193469e+10,1
116,118,668,PR,Feminino,37,6,1678644,1,1,0,1.156383e+10,0
170,172,484,RS,Feminino,29,4,13011439,1,1,0,1.640179e+09,0
230,232,673,RS,Masculino,72,1,0,2,0,1,1.119812e+09,0

In [21]:
median_salary = sts.median(dados['Salary'])
dados.loc[dados['Salary'] >= 2 * stdev_salary] = median_salary
dados.loc[dados['Salary'] >= 2 * stdev_salary] #Checking for any remaining outliers.

Empty DataFrame
Columns: [ID, Score, State, Gender, Age, Wealth, Balance, Products, CreditCard, Active, Salary, Exited]
Index: []